{
  "nodes": [
    {
      "op": "_ones", 
      "name": "_ones0", 
      "attr": {
        "dtype": "float32", 
        "shape": "(1, 80, 60)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "250.0"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm1", 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "actv1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm2_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm2_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm2", 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "actv2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm3", 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "actv3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm4_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm4_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm4", 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "actv4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_5_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm5_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm5_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm5", 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_6_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_6_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm6_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm6_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm6", 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [55, 0, 1], [56, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_7_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_7_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm7_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm7_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm7", 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool7", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_8_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_8_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv8", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm8_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm8_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm8_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm8_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm8", 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 1], [75, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_9_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_9_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv9", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm9_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm9_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm9_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm9_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm9", 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act9", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_10_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_10_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv10", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm10_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm10_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm10_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm10_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm10", 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act10", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_11_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_11_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv11", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm11_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm11_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm11_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm11_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm11", 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act11", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_12_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_12_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv12", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm12_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm12_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm12", 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act12", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "arg:conv_13_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "arg:conv_13_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv13", 
      "attr": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "norm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm13_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "norm13_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "norm13", 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act13", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "block", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convh_weight", 
      "attr": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convh_bias", 
      "attr": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convh", 
      "attr": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(4, 4)"
      }, 
      "inputs": [[122, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "normh_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normh_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normh_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normh_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "normh", 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "acth", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {"num_args": "2"}, 
      "inputs": [[123, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convi_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convi_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convi", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "normi_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normi_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normi_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normi_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "normi", 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 1], [140, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "acti", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convo_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convo_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convo", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "normo_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normo_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normo_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "normo_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "normo", 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "acto", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "min", 
      "name": "min0", 
      "attr": {"axis": "()"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub0", 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max0", 
      "attr": {"axis": "()"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub1", 
      "inputs": [[154, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div0", 
      "inputs": [[153, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[1, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub2", 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub3", 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs0", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lossfactor", 
      "attr": {
        "__init__": "[\"uniform\", {\"scale\": 0.1}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div1", 
      "inputs": [[161, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[159, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[165, 0, 0]]
    }
  ], 
  "arg_nodes": [
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    15, 
    16, 
    17, 
    18, 
    22, 
    23, 
    25, 
    26, 
    27, 
    28, 
    31, 
    32, 
    34, 
    35, 
    36, 
    37, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    62, 
    63, 
    64, 
    65, 
    69, 
    70, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    81, 
    82, 
    83, 
    84, 
    87, 
    88, 
    90, 
    91, 
    92, 
    93, 
    96, 
    97, 
    99, 
    100, 
    101, 
    102, 
    105, 
    106, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    117, 
    118, 
    119, 
    120, 
    124, 
    125, 
    127, 
    128, 
    129, 
    130, 
    134, 
    135, 
    137, 
    138, 
    139, 
    140, 
    143, 
    144, 
    146, 
    147, 
    148, 
    149, 
    158, 
    162
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199
  ], 
  "heads": [[166, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1201]}
}